src/main/java/ok/dht/test/gerasimov/report/wrk2/wrk2_put_rate_3000.txt
Running 1m test @ http://localhost:25565
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.285ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.27ms    1.45ms  34.50ms   99.16%
    Req/Sec     3.17k   432.23    10.70k    84.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.17ms
 75.000%    1.61ms
 90.000%    2.06ms
 99.000%    2.53ms
 99.900%   23.90ms
 99.990%   32.77ms
 99.999%   34.40ms
100.000%   34.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.063     0.000000            1         1.00
       0.362     0.100000        15002         1.11
       0.598     0.200000        30072         1.25
       0.815     0.300000        45053         1.43
       1.008     0.400000        60031         1.67
       1.168     0.500000        75032         2.00
       1.238     0.550000        82539         2.22
       1.306     0.600000        90006         2.50
       1.380     0.650000        97511         2.86
       1.479     0.700000       105045         3.33
       1.605     0.750000       112527         4.00
       1.677     0.775000       116258         4.44
       1.747     0.800000       120021         5.00
       1.822     0.825000       123739         5.71
       1.899     0.850000       127527         6.67
       1.974     0.875000       131268         8.00
       2.015     0.887500       133123         8.89
       2.057     0.900000       134989        10.00
       2.099     0.912500       136870        11.43
       2.141     0.925000       138738        13.33
       2.189     0.937500       140677        16.00
       2.213     0.943750       141598        17.78
       2.239     0.950000       142532        20.00
       2.267     0.956250       143444        22.86
       2.297     0.962500       144397        26.67
       2.329     0.968750       145338        32.00
       2.345     0.971875       145785        35.56
       2.365     0.975000       146269        40.00
       2.387     0.978125       146733        45.71
       2.409     0.981250       147170        53.33
       2.441     0.984375       147654        64.00
       2.457     0.985938       147886        71.11
       2.479     0.987500       148119        80.00
       2.507     0.989062       148345        91.43
       2.561     0.990625       148580       106.67
       3.855     0.992188       148811       128.00
       5.479     0.992969       148928       142.22
       7.295     0.993750       149046       160.00
       9.143     0.994531       149162       182.86
      10.927     0.995313       149279       213.33
      12.839     0.996094       149397       256.00
      13.839     0.996484       149456       284.44
      14.863     0.996875       149514       320.00
      15.943     0.997266       149574       365.71
      17.183     0.997656       149631       426.67
      18.607     0.998047       149690       512.00
      19.503     0.998242       149719       568.89
      20.447     0.998437       149748       640.00
      21.599     0.998633       149777       731.43
      22.751     0.998828       149807       853.33
      24.111     0.999023       149836      1024.00
      24.927     0.999121       149851      1137.78
      25.679     0.999219       149866      1280.00
      26.383     0.999316       149880      1462.86
      27.167     0.999414       149896      1706.67
      27.791     0.999512       149909      2048.00
      28.159     0.999561       149917      2275.56
      28.719     0.999609       149924      2560.00
      29.247     0.999658       149931      2925.71
      30.031     0.999707       149939      3413.33
      30.767     0.999756       149946      4096.00
      31.199     0.999780       149950      4551.11
      31.519     0.999805       149953      5120.00
      31.919     0.999829       149957      5851.43
      32.255     0.999854       149961      6826.67
      32.543     0.999878       149964      8192.00
      32.719     0.999890       149966      9102.22
      32.863     0.999902       149968     10240.00
      32.991     0.999915       149970     11702.86
      33.151     0.999927       149972     13653.33
      33.279     0.999939       149973     16384.00
      33.311     0.999945       149974     18204.44
      33.503     0.999951       149975     20480.00
      33.695     0.999957       149976     23405.71
      33.855     0.999963       149977     27306.67
      34.015     0.999969       149978     32768.00
      34.015     0.999973       149978     36408.89
      34.175     0.999976       149979     40960.00
      34.175     0.999979       149979     46811.43
      34.271     0.999982       149980     54613.33
      34.271     0.999985       149980     65536.00
      34.271     0.999986       149980     72817.78
      34.399     0.999988       149981     81920.00
      34.399     0.999989       149981     93622.86
      34.399     0.999991       149981    109226.67
      34.399     0.999992       149981    131072.00
      34.399     0.999993       149981    145635.56
      34.527     0.999994       149982    163840.00
      34.527     1.000000       149982          inf
#[Mean    =        1.274, StdDeviation   =        1.447]
#[Max     =       34.496, Total count    =       149982]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  179993 requests in 1.00m, 11.50MB read
Requests/sec:   2999.88
Transfer/sec:    196.28KB